Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: %1$s deletes your cookies, history, and site data when you close all your private tabs. %2$s
am: ሁሉንም የግል ትሮችዎን ሲዘጉ %1$s ኩኪዎችዎን፣ ታሪክዎን እና የድረ-ገጽ ውሂብዎን ይሰርዛል። %2$s

source: %1$s deletes your cookies, history, and site data when you close all your private windows. %2$s
am: ሁሉንም የግል መስኮቶችዎን ሲዘጉ %1$s ኩኪዎችዎን፣ ታሪክዎን እና የድረ-ገፅ ውሂብዎን ይሰርዛል። %2$s

source: %1$s essentials
am: %1$s አስፈላጊ ነገሮች

source: %1$s extensions
am: %1$s ቅጥያዎች

source: %1$s has a new update
am: %1$s አዲስ ዝማኔ አለው

source: %1$s has been added to %2$s
am: %1$s ወደ %2$s ታክሏል

source: %1$s has been disabled due to security or stability issues.
am: %1$s በደህንነት ወይም በመረጋጋት ችግሮች ምክንያት ተሰናክሏል።

source: %1$s is not compatible with your version of %2$s (version %3$s).
am: %1$s ከእርስዎ የ%2$s (የ%3$s ስሪት) ጋር ተኳሃኝ አይደለም።

source: %1$s is produced by Mozilla.
am: %1$s የሚመረተው በሞዚላ ነው።

source: %1$s is requesting your username and password.
am: %1$s የእርስዎን የተጠቃሚ ስም እና የይለፍ ቃል እየጠየቀ ነው።

source: %1$s just refused cookies for you
am: %1$s አሁን ለእርስዎ ኩኪዎችን አልተቀበለም

source: %1$s may install and run studies from time to time.
am: %1$s ከጊዜ ወደ ጊዜ ጥናቶችን ሊጭን እና ሊያሄድ ይችላል።

source: %1$s on %2$s %3$s
am: %1$s በ%2$s %3$s ላይ

source: %1$s open tabs. Tap to switch tabs.
am: %1$s ትሮች ክፍት። ትሮችን ለመቀየር መታ ያድርጉ።

source: %1$s out of 5 stars
am: %1$s ከ5 ኮከቦች

source: %1$s • paused
am: %1$s • ባለበት ቆሟል

source: %1$s (Private Mode)
am: %1$s (የግል ሁነታ)

source: %1$s puts people over profits and defends your privacy by blocking cross-site trackers. Learn more in our %2$s.
am: %1$s ሰዎችን ከትርፍ በላይ ያስቀምጣቸዋል እና ድረ-ገጽ ተሻጋሪ መከታተያዎችን በማገድ የእርስዎን ግላዊነት ይጠብቃል። በእኛ %2$s ውስጥ የበለጠ ይወቁ።

source: %1$s requests additional data collection
am: %1$s ተጨማሪ መረጃ መሰብሰብን ይጠይቃል

source: %1$s requests additional permissions.
am: %1$s ተጨማሪ ፈቃዶችን ይጠይቃል።

source: %1$s requests additional settings
am: %1$s ተጨማሪ ቅንብሮችን ይጠይቃል

source: %1$s Sent from %2$s 🦊 %3$s
am: %1$s ከ%2$s 🦊 %3$s የተላከ

source: %1$s Sent from %2$s 🦊 Try the mobile browser: %3$s
am: %1$s ከ%2$s የተላከ 🦊 የሞባይል አሳሹን ይሞክሩ፡- %3$s

source: %1$s tabs closed: %2$d
am: %1$s ትሮች ተዘግተዋል፡- %2$d

source: %1$s tries to automatically reject all cookie requests on supported sites.
am: %1$s በሚደገፉ ድረ-ገፆች ላይ ያሉ ሁሉንም የኩኪ ጥያቄዎችን በራስ ሰር ውድቅ ለማድረግ ይሞክራል።

source: %1$s • unknown time
am: %1$s • ያልታወቀ ጊዜ

source: %1$s violates Mozilla’s policies and can’t be installed.
am: %1$s የMozilla መመሪያዎችን ይጥሳል እና ሊጫን አይችልም።

source: %1$s violates Mozilla’s policies and can’t be installed on %2$s.
am: %1$s የMozilla መመሪያዎችን ይጥሳል እና በ%2$s ላይ መጫን አይቻልም።

source: %1$s wasn’t downloaded.
am: %1$s አልወረደም።

source: %1$s will clear this site’s cookies and refresh the page. Clearing all cookies may sign you out or empty shopping carts.
am: %1$s የዚህን ድረ-ገፅ ኩኪዎች ያፀዳ እና ገጹን ያድሳል። ሁሉንም ኩኪዎች ማጽዳት እርስዎን ሊያስወጣዎት ወይም የግዢ ጋሪዎችን ባዶ ሊያደርግ ይችላል።

source: %1$s will never offer to translate sites in this language.
am: %1$s በዚህ ቋንቋ ጣቢያዎችን ለመተርጎም በጭራሽ አይሰጥም።

source: %1$s will offer to translate sites in this language.
am: %1$s ጣቢያዎችን በዚህ ቋንቋ ለመተርጎም ያቀርባል።

source: %1$s will translate this language automatically when the page loads.
am: %1$s ገጹ ሲጫን ይህን ቋንቋ በራስ-ሰር ይተረጉመዋል።

source: %2$s is requesting your username and password. The site says: “%1$s”
am: %2$s የእርስዎን የተጠቃሚ ስም እና የይለፍ ቃል እየጠየቀ ነው። ድረ-ገፁ እንዲህ ይላል፡- "%1$s"

source: 2. Tap <b>Permissions</b>
am: 2. <b>ፍቃዶችን</b>ን መታ ያድርጉ

source: 3. Toggle <b>%1$s</b> to ON
am: 3. <b>%1$s</b> ን ወደ አብራ ቀይር

source: About %1$s
am: ስለ %1$s

source: About translations in %1$s
am: በ%1$s ውስጥ ስለ ትርጉሞች

source: A browser built for people, not profits.
am: ለሰዎች የተሰራ አሳሽ እንጂ ትርፍ አይደለም።

source: Accept and edit suggestion
am: ጥቆማን ተቀበል እና አርትዕ

source: Accept the Risk and Continue
am: አደጋውን ይቀበሉ እና ይቀጥሉ

source: Access %1$s from the %2$s menu.
am: ከ%2$s ምናሌ %1$sን ይድረሱ።

source: Access browser activity during navigation
am: በአሰሳ ጊዜ የአሳሽ እንቅስቃሴን ይድረሱ

source: Access browser tabs
am: የአሳሽ ትሮችን ይድረሱ

source: Access browsing history
am: የአሰሳ ታሪክን ይድረሱ

source: Accessibility
am: ተደራሽነት

source: Access recently closed tabs
am: በቅርብ ጊዜ የተዘጉ ትሮችን ይድረሱ

source: Access to the file was denied
am: የፋይሉ መዳረሻ ተከልክሏል

source: Access your data for %1$s
am: የ%1$s ውሂብዎን ይድረሱበት

source: Access your data for all websites
am: ለሁሉም ድር ጣቢያዎች የእርስዎን ውሂብ ይድረሱበት

source: Access your data for sites in %1$d domains
am: በ%1$d ጎራዎች ውስጥ የጣቢያዎችህን ውሂብ ይድረሱበት

source: Access your data for sites in the %1$s domain
am: በ%1$s ጎራ ስር ባሉ ድረ-ገፆች ያለ ውሂብዎን ይድረሱበት

source: Access your data on %1$d other domains
am: በ%1$d ሌሎች ጎራዎች ላይ የእርስዎን ውሂብ ይድረሱበት

source: Access your data on %1$d other sites
am: በ%1$d ሌሎች ድረ-ገፆች ላይ የእርስዎን ውሂብ ይድረሱበት

source: Access your data on 1 other domain
am: በሌላ 1 ጎራ ላይ የእርስዎን ውሂብ ይድረሱበት

source: Access your data on 1 other site
am: በሌላ 1 ድረ-ገፅ ላይ የእርስዎን ውሂብ ይድረሱበት

source: Access your location
am: አካባቢዎን ይድረሱበት

source: Account info
am: የመለያ መረጃ

source: Account picture
am: የመለያ ምስል

source: Account settings
am: የመለያ ቅንብሮች

source: Active
am: ንቁ

source: Adapts to your device settings
am: ከመሣሪያዎ ቅንብሮች ጋር ይስማማል

source: Ad blocker
am: ማስታወቂያ ማገጃ

source: Ad by %s
am: ማስታወቂያ በ%s

source: Add
am: ጨምር

source: Add %1$s
am: ያክሉ %1$s

source: Add %1$s?
am: %1$s ይታከል?

source: Add %1$s and %2$s to %3$s
am: %1$sን እና %2$sን ወደ %3$s ያክሉ

source: Add %1$s to %2$s
am: %1$sን ወደ %2$s ያክሉ

source: Add add-on button
am: የተጨማሪ ቁልፍ ያክሉ

source: Add address
am: አድራሻ ጨምር

source: Add a fake login for this domain
am: ለዚህ ጎራ የውሸት መግቢያ ያክሉ

source: Add a name
am: ስም ይጨምሩ

source: Add a new folder
am: አዲስ አቃፊ ያክሉ

source: Add app to Home screen
am: መተግበሪያ ወደ መነሻ ማያ ገጽ ያክሉ

source: Add app to Home screen…
am: መተግበሪያን ወደ መነሻ ማያ ገጽ አክል…

source: Add bookmarks as you browse so you can find your favorite sites later.
am: ቆይተው የሚወዷቸውን ጣቢያዎች ማግኘት እንዲችሉ በሚያስሱበት ጊዜ ዕልባቶችን ያክሉ።

source: Add bookmark, Shortcut, Home, Collection, PDF
am: ዕልባት አክል፣ አቋራጭ፣ ዋና ገፅ፣ ስብስብ፣ ፒዲኤፍ

source: Add card
am: ካርድ ጨምር

source: Add credit card
am: ክሬዲት ካርድ ያክሉ

source: Added to shortcuts!
am: ወደ አቋራጮች ታክሏል!

source: Add Firefox widget
am: የFirefox መግብርን ያክሉ

source: Add folder
am: አቃፊ አክል

source: Add login
am: መግቢያ አክል

source: Add new address for selected locale
am: ለተመረጠው አካባቢ አዲስ አድራሻ ያክሉ

source: Add new collection
am: አዲስ ስብስብ ያክሉ

source: Add new login
am: አዲስ መግቢያ ያክሉ

source: Add new search engine
am: አዲስ የፍለጋ ፍርግም ያክሉ

source: Add-on collection modified. Quitting the application to apply changes…
am: የተጨማሪ ስብስብ ተለውጧል። ለውጦችን ለማካተት መተግበሪያውን በማቆም ላይ…

source: Add-on icon
am: የተጨማሪ አዶ

source: Add-on is already installed
am: ተጨማሪ አስቀድሞ ተጭኗል

source: Add-on is not supported
am: ተጨማሪ አይደገፍም

source: Add-ons
am: ተጨማሪዎች

source: Add-ons are temporarily disabled
am: ተጨማሪዎች ለጊዜው ተሰናክለዋል

source: Add-ons Manager
am: ተጨማሪዎች አስተዳዳሪ

source: Add-ons, navigate up
am: ተጨማሪዎች፣ ወደ ላይ ዳስስ

source: Add-on updates
am: ተጨማሪ ዝመናዎች

source: Add password
am: የይለፍ ቃል ያክሉ

source: Add private browsing shortcut
am: የግል አሰሳ አቋራጭ ያክሉ

source: Add private tab
am: የግል ትርን ያክሉ

source: Address bar
am: የአድራሻ አሞሌ

source: Address bar - Firefox Suggest
am: የአድራሻ አሞሌ - Firefox Suggest

source: Address bar location
am: የአድራሻ አሞሌ መገኛ

source: Address bar preferences
am: የአድራሻ አሞሌ ምርጫዎች

source: Addresses
am: አድራሻዎች

source: Address Not Found
am: አድራሻ አልተገኘም

source: Add search engine
am: የፍለጋ ፍርግም አክል

source: Add site
am: ድረ-ገፅ ያክሉ

source: Add Site
am: ጣቢያ ያክሉ

source: Add tab
am: ትር አክል

source: Add them to %1$s
am: ወደ %1$s ያክሏቸው

source: Add third-party extensions to enhance your security, productivity, and more.
am: የእርስዎን ደህንነት፣ ምርታማነት እና ሌሎችንም ለማሻሻል የሶስተኛ ወገን ቅጥያዎችን ያክሉ።

source: Add to active tabs
am: ወደ ንቁ ትሮች ያክሉ

source: Add to contact
am: ወደ እውቂያ አክል

source: Add to Home screen
am: ወደ መነሻ ማያ ገጽ ጨምር

source: Add to Home screen…
am: ወደ መነሻ ማያ ገጽ አክል…

source: Add to inactive tabs
am: ወደ ቦዘኑ ትሮች ያክሉ

source: Add to private tabs
am: ወደ የግል ትሮች ያክሉ

source: Add to shortcuts
am: ወደ አቋራጭ ጨምር

source: Add username to saved password?
am: የተጠቃሚ ስም በተቀመጠው ይለፍ ቃል ላይ ይታከል?

source: Adjusted rating
am: የተስተካከለ ደረጃ

source: Advanced
am: የላቀ

source: Advanced…
am: የላቀ…

source: After one day
am: ከአንድ ቀን በኋላ

source: After one month
am: ከአንድ ወር በኋላ

source: After one week
am: ከአንድ ሳምንት በኋላ

source: Agree and continue
am: እስማማለሁ እና ቀጥል

source: Agree and start browsing
am: ይስማሙ እና ማሰስ ይጀምሩ

source: All actions
am: ሁሉም ድርጊቶች

source: All cookies (will cause websites to break)
am: ሁሉም ኩኪዎች (ድረ-ገፆች ባግባቡ እንዳይሰሩ ያደርጋል)

source: All languages
am: ሁሉም ቋንቋዎች

source: Allow
am: ፍቀድ

source: ALLOW
am: ፍቀድ

source: Allow %1$s to automatically reject cookie requests when possible?
am: ሲቻል %1$s የኩኪ ጥያቄዎችን በራስ ሰር ውድቅ እንዲያደርግ ይፈቀድለት?

source: Allow %1$s to decline a site’s cookie consent request if possible?
am: ከተቻለ %1$s የጣቢያውን የኩኪ ፍቃድ ጥያቄ ውድቅ እንዲያደርግ ይፈቀድለት?

source: Allow %1$s to open %2$s
am: %1$s %2$sን እንዲከፍት ፍቀድ

source: Allow %1$s to play DRM-controlled content?
am: %1$s በDRM የሚቆጣጠረውን ይዘት እንዲያጫውት ይፈቀድለት?

source: Allow %1$s to reject cookie banners?
am: %1$s የኩኪ ሰንደቆችን ውድቅ እንዲያደርግ ይፈቀድለት?

source: Allow %1$s to send notifications?
am: %1$s ማሳወቂያዎችን እንዲልክ ይፈቀድለት?

source: Allow %1$s to store data in persistent storage?
am: %1$s በቋሚ ማከማቻ ውስጥ ውሂብ እንዲያከማች ይፈቀድለት?

source: Allow %1$s to use its cookies on %2$s?
am: %1$s ኩኪዎቹን በ%2$s ላይ እንዲጠቀም ይፈቀድለት?

source: Allow %1$s to use your camera?
am: %1$s ካሜራዎን እንዲጠቀም ይፈቀድለት?

source: Allow %1$s to use your camera and microphone?
am: %1$s የእርስዎን ካሜራ እና ማይክሮፎን እንዲጠቀም ይፈቀድለት?

source: Allow %1$s to use your location?
am: %1$s አካባቢዎን እንዲጠቀም ይፈቀድለት?

source: Allow %1$s to use your microphone?
am: %1$s ማይክሮፎንዎን እንዲጠቀም ይፈቀድለት?

source: Allow audio and video
am: ድምፅ እና ተንቀሳቃሽ ምሥል ፍቀድ

source: Allowed
am: ተፈቅዷል

source: Allow extension to run in private browsing
am: ቅጥያ በግል አሰሳ ውስጥ እንዲሰራ ፍቀድ

source: Allow for all sites
am: ለሁሉም ጣቢያዎች ፍቀድ

source: Allow in private browsing
am: በግል አሰሳ ፍቀድ

source: Allow screenshots in private browsing
am: በግል አሰሳ ውስጥ ቅጽበታዊ ገጽ እይታዎችን ፍቀድ

source: Allow search suggestions in private sessions?
am: በግል ክፍለ-ጊዜ የፍለጋ ጥቆማዎች ይፈቀድ?

source: Allows Mozilla to install and run studies
am: ሞዚላ ጥናቶችን እንዲጭን እና እንዲያሄድ ይፈቅዳል

source: Allow this site to open?
am: ይህ ጣቢያ እንዲከፈት ይፈቀድለት?

source: Allow unverified third-party scripts to access your data
am: ያልተረጋገጡ የሶስተኛ ወገን ስክሪፕቶች የእርስዎን ውሂብ እንዲደርሱበት ይፍቀዱ

source: All third-party cookies (may cause websites to break)
am: ሁሉም የሶስተኛ ወገን ኩኪዎች (ድረ-ገፆች ባግባቡ እንዳይሰሩ ሊያደርግ ይችላል)

source: Almost there! Two steps finished and 1 to go.
am: ሊደርሱ ነው! ሁለት ደረጃዎች ተጠናቅቀዋል እና 1 ቀርቷል።

source: Almost there! You’re just 1 step away from the finish line.
am: ሊደርሱ ነው! ከመጨረሻው መስመር 1 እርምጃ ብቻ ይቀርዎታል።

source: A login with that username already exists
am: በዚያ የተጠቃሚ ስም መግቢያ አስቀድሞ አለ

source: Always
am: ሁሌም

source: Always download in data saving mode
am: ሁልጊዜ በውሂብ ቁጠባ ሁነታ አውርድ

source: Always download languages in data saving mode
am: ሁልጊዜ ቋንቋዎችን በውሂብ ቁጠባ ሁነታ አውርድ

source: Always offer to translate
am: ሁልጊዜ ለመተርጎም አቅርብ

source: Always open links in apps
am: ሁልጊዜ በመተግበሪያዎች ውስጥ አገናኞችን ይክፈቱ

source: Always request desktop site
am: ሁልጊዜ የዴስክቶፕ ጣቢያን ይጠይቁ

source: Always translate
am: ሁልጊዜ ተርጉም

source: Always translate %1$s
am: ሁልጊዜ %1$sን ተርጉም

source: Analysis is up to date
am: ትንታኔው ወቅታዊ ነው

source: A new permission is required
am: አዲስ ፈቃድ ያስፈልጋል

source: Anti-tracking gem. Stop invisible trackers and spying ads.
am: ፀረ-ክትትል ዕንቁ. የማይታዩ መከታተያዎች እና የስለላ ማስታወቂያዎችን ያቁሙ።

source: Apr
am: ሚያ

source: Are these reviews reliable? Check now to see an adjusted rating.
am: እነዚህ ግምገማዎች አስተማማኝ ናቸው? የተስተካከለ ደረጃን ለማየት አሁን ያረጋግጡ።

source: Are you sure?
am: እርግጠኛ ነዎት?

source: Are you sure that you want to clear all the cookies and data for the site <b>%s</b>?
am: የ<b>%s</b> ድረ-ገፅን ሁሉንም ኩኪዎች እና ውሂቦች ማጽዳት እንደሚፈልጉ እርግጠኛ ነዎት?

source: Are you sure that you want to clear all the permissions for this site?
am: እርግጠኛ ነዎት የዚህ ድረ-ገፅ ሁሉንም ፈቃዶች ማጽዳት ይፈልጋሉ?

source: Are you sure that you want to clear all the permissions on all sites?
am: እርግጠኛ ነዎት በሁሉም ድረ-ገፆች ላይ ያሉትን ሁሉንም ፈቃዶች ማጽዳት ይፈልጋሉ?

source: Are you sure that you want to clear this permission for this site?
am: እርግጠኛ ነዎት የዚህን ድረ-ገፅ ፈቃድ ማጽዳት ይፈልጋሉ?

source: Are you sure you want to delete %1$s?
am: እርግጠኛ ነዎት %1$sን መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete the selected items?
am: እርግጠኛ ነዎት የተመረጡትን መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete this address?
am: እርግጠኛ ነዎት ይህን አድራሻ መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete this bookmark?
am: እርግጠኛ ነዎት ይህን እልባት መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete this credit card?
am: እርግጠኛ ነዎት ይህን ክሬዲት ካርድ መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete this folder?
am: እርግጠኛ ነዎት ይህን አቃፊ መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete this login?
am: እርግጠኛ ነዎት ይህን መግቢያ መሰረዝ ይፈልጋሉ?

source: Are you sure you want to delete this password?
am: እርግጠኛ ነዎት ይህን የይለፍ ቃል መሰረዝ ይፈልጋሉ?

source: A root certificate will expire, causing some features to stop working on March 14.
am: የዋና ሰርተፍኬት ጊዜው ያበቃል፣ ይህም አንዳንድ ባህሪያት ማርች 14 ላይ መስራት እንዲያቆሙ ያደርጋል።

source: Articles powered by %s
am: በ%s የተጎላበተ መጣጥፎች

source: Artist series
am: ተከታታይ አርቲስት

source: A site is playing media
am: አንድ ድረ-ገፅ ሚዲያ እየተጫወተ ነው።

source: Ask %1$s to auto refuse cookies
am: %1$s ኩኪዎችን በራስ-እንዳይቀበል ጠይቅ

source: Ask before opening
am: ከመክፈት በፊት ጠይቅ

source: Ask before sending
am: ከመላክህ በፊት ጠይቅ

source: Ask to add site
am: ጣቢያ ለመጨመር ይጠይቁ

source: Ask to allow
am: ለመፍቀድ ጠይቅ

source: Ask to save
am: ለማስቀመጥ ይጠይቁ

source: Audio and video will play on Wi-Fi
am: ኦዲዮ እና ቪዲዮ በWi-Fi ላይ ይጫወታሉ

source: Aug
am: ነሐ

source: authentication information
am: የማረጋገጫ መረጃ

source: Author
am: ደራሲ

source: Authors
am: ደራሲያን

source: Auto-close after one month?
am: ከአንድ ወር በኋላ በራስ-ሰር ይዘጋ?

source: Auto-close enabled
am: በራስ-ሰር መዝጋት ነቅቷል

source: Auto-close open tabs
am: ክፍት ትሮችን በራስ-ሰር ዝጋ

source: Autocomplete URLs
am: ራስ-አጠናቅቅ

source: Autofill
am: ራስ ሙላ

source: Autofill in %1$s
am: በ%1$s ውስጥ በራስ-ሙላ

source: Autofill in other apps
am: በሌሎች መተግበሪያዎች ውስጥ በራስ-ሙላ

source: Automatic
am: ራስ ሰር

source: Automatically answer cookie pop-ups for distraction-free browsing. %1$s will reject all requests if possible.
am: ከማስተጓጎል ለነጻ አሰሳ የኩኪ ብቅ-ባዮችን በራስ-ሰር መልስ። ከተቻለ %1$s ሁሉንም ጥያቄዎች ውድቅ ያደርጋል።

source: Automatically attempts to connect to sites using HTTPS encryption protocol for increased security.
am: ለበለጠ ደህንነት HTTPS ምስጠራ ፕሮቶኮልን በመጠቀም ከድረ-ገፆች ጋር በራስ-ሰር ለመገናኘት ይሞክራል።

source: Automatically deletes browsing data when you select \"Quit\" from the main menu
am: ከዋናው ምናሌ ውስጥ \"አቋርጥ\"ን ስትመርጡ የአሰሳ ውሂብን በራስ ሰር ይሰርዛል

source: Automatically reject cookie requests, when possible.
am: በሚቻልበት ጊዜ የኩኪ ጥያቄዎችን በራስ-ሰር ውድቅ ያድርጉ።

source: Automatically send crash reports
am: የብልሽት ሪፖርቶችን በራስ-ሰር ይላኩ

source: Automatically submit crash reports
am: የብልሽት ሪፖርቶችን በራስ-ሰር አስገባ

source: Automatic font sizing
am: ራስ-ሰር የቅርጸ-ቁምፊ መጠን

source: Automatic translation
am: ራስ-ሰር ትርጉም

source: Autoplay
am: ራስ-አጫዋች

source: Available languages
am: የሚገኙ ቋንቋዎች

source: Back and close search
am: ተመለስ እና ፍለጋን ዝጋ

source: Back to main menu
am: ወደ ዋናው ምናሌ ተመለስ

source: Balanced for privacy and performance. Pages load normally.
am: ለግላዊነት እና ለአፈጻጸም የተመጣጠነ። ገጾች በመደበኛነት ይጫናሉ።

source: Based on reliable reviews
am: በአስተማማኝ ግምገማዎች ላይ የተመሠረተ

source: Be careful on this site
am: በዚህ ድረ-ገፅ ላይ ይጠንቀቁ

source: <b>Highlights</b> are from %s reviews within the last 80 days that we believe to be reliable.
am: <b>ዋና ዋናዎቹ</b> አስተማማኝ ናቸው ብለን የምናምንባቸው ባለፉት 80 ቀናት ውስጥ ከ%s ግምገማዎች የተገኙ ናቸው።

source: Block
am: አግድ

source: Block ads effectively and efficiently.
am: ማስታወቂያዎችን በብቃት እና በጥራት አግድ።

source: Block audio and video
am: ድምፅ እና ተንቀሳቃሽ ምሥል አግድ

source: Block audio and video on cellular data only
am: በተንቀሳቃሽ ስልክ መገናኛ ላይ ብቻ ድምፅ እና ተንቀሳቃሽ ምሥል አግድ

source: Block audio only
am: ድምፅን ብቻ አግድ

source: Block content on any page
am: በማንኛውም ገጽ ላይ ይዘትን አግድ

source: Blocked
am: ታግዷል

source: Blocked by Android
am: በAndroid ታግዷል

source: Blocks cookies that ad networks and analytics companies use to compile your browsing data across many sites.
am: የማስታወቂያ አውታረ መረቦች እና የትንታኔ ኩባንያዎች የእርስዎን የአሰሳ ውሂብ በብዙ ድረ-ገጾች ላይ ለመሰብሰብ የሚጠቀሙባቸውን ኩኪዎች ያግዳል።

source: Blocks more trackers so pages load faster, but some on-page functionality may break.
am: ገፆች በፍጥነት እንዲጫኑ ተጨማሪ መከታተያዎችን ያግዳል፣ ነገር ግን አንዳንድ በገጽ ላይ ያሉ ተግባራት ላይሰሩ ይችላሉ።

source: Blue
am: ሰማያዊ

source: Blue Hour
am: ፈዛዛ ሰማያዊ

source: Bookmark
am: እልባት

source: Bookmark page
am: የዕልባት ገጽ

source: bookmarks
am: ዕልባቶች

source: Bookmarks
am: እልባቶች

source: Bookmark saved!
am: እልባት ተቀምጧል!

source: Bookmarks deleted
am: እልባቶች ተሰርዘዋል

source: Bookmarks Menu
am: የእልባቶች ምናሌ

source: Bookmarks saved!
am: እልባቶች ተቀምጠዋል!

source: Bookmarks saved in “%s”!
am: ዕልባቶች በ “%s” ውስጥ ተቀምጠዋል!

source: Bookmarks Toolbar
am: የእልባቶች መሣሪያ አሞሌ

source: Bookmark this page
am: ለዚህ ገጽ ዕልባት ያድርጉ

source: Bottom
am: ከታች

source: Browse faster with new navigation
am: በአዲስ አሰሳ በፍጥነት ያስሱ

source: Browser isn’t supported or blocked
am: አሳሽ አይደገፍም ወይም ታግዷል

source: Browse with no saved cookies or history in %1$s
am: በ%1$s ውስጥ ያለ ምንም ኩኪዎች ወይም ታሪክ ማስቀመጥ ያስሱ

source: Browse without a trace
am: ያለ ዱካ ያስሱ

source: Browse without being followed
am: ያለተከታታይ ያስሱ

source: browsing activity
am: የአሰሳ እንቅስቃሴ

source: Browsing data deleted
am: የአሰሳ ውሂብ ተሰርዟል

source: Browsing history
am: የአሰሳ ታሪክ

source: Browsing history and site data
am: የአሰሳ ታሪክ እና የድረ-ገፅ ውሂብ

source: Buttons, links, and other content
am: አዝራሮች፣ አገናኞች እና ሌሎች ይዘቶች

source: By continuing, you agree to the %1$s.
am: በመቀጠል፣ በ%1$s ተስማምተዋል።

source: By continuing, you agree to the Firefox %1$s.
am: በመቀጠል፣ በFirefox %1$s ተስማምተዋል።

source: By selecting “Yes, try it” you agree to %1$s by Mozilla’s %2$s and %3$s.
am: “አዎ ይሞክሩት” ን በመምረጥ በ%1$s በMozillaው %2$s እና %3$s ተስማምተዋል።

source: By selecting “Yes, try it” you agree to %1$s’s %2$s and %3$s’s %4$s.
am: "አዎ ይሞክሩት"ን በመምረጥ በ%1$s %2$s እና በ%3$s %4$s ተስማምተዋል።

source: By selecting “Yes, try it” you agree to the following from %1$s:
am: “አዎ ይሞከር”ን በመምረጥ ከ%1$s በሚከተለው ይስማማሉ፡

source: Cached images and files
am: የተሸጎጡ ምስሎች እና ፋይሎች

source: Call
am: ደውል

source: Call with…
am: ይደውሉ በ…

source: Camera
am: ካሜራ

source: Camera access needed. Go to Android settings, tap permissions, and tap allow.
am: የካሜራ ፈቃድ ያስፈልጋል። ወደ አንድሮይድ ቅንብሮች ይሂዱ፣ ፈቃዶችን ይንኩ እና ፍቀድን ይንኩ።

source: Camera and microphone are on
am: ካሜራ እና ማይክሮፎን በርተዋል

source: Camera is on
am: ካሜራ በርቷል

source: Campaign measurement
am: የዘመቻ መለኪያ

source: Campaign measurement data
am: የዘመቻ መለኪያ ውሂብ

source: Cancel %1$s download?
am: %1$s ማውረድ ይቅር?

source: Cancel downloads
am: ማውረዶችን አቋርጥ

source: Cancel private downloads?
am: የግል ውርዶች ይሰረዙ?

source: Cannot Complete Request
am: ጥያቄን ማጠናቀቅ አይቻልም

source: Cannot share to this app
am: ለዚህ መተግበሪያ ማጋራት አይቻልም

source: Can’t edit default folders
am: ነባሪ አቃፊዎችን ማርትዕ አይቻልም

source: Can’t install extension
am: ቅጥያ መጫን አልተቻለም

source: Can’t pay, check out or shop
am: መክፈል፣ ማዘዝ ወይም መግዛት አይቻልም

source: Can’t save password
am: የይለፍ ቃል ማስቀመጥ አልተቻለም

source: Can’t sign in or register
am: መግባት ወይም መመዝገብ አይቻልም

source: Card Number
am: የካርድ ቁጥር

source: Card number will be encrypted. Security code won’t be saved.
am: የካርድ ቁጥር ይሰወራል ። የደህንነት የሚስጥር ፅሑፍ አይቀመጥም።

source: CFR Tools
am: CFR መሣሪያዎች

source: Change your password, manage data collection, or delete your account
am: የይለፍ ቃልዎን ይቀይሩ፣ የውሂብ መሰብሰብን ያስተዳድሩ ወይም መለያዎን ይሰርዙ

source: Checking review quality
am: የግምገማ ጥራት በመፈተሽ ላይ

source: Checking review quality (%s)
am: የግምገማውን ጥራት በመፈተሽ ላይ (%s)

source: Check now
am: አሁን ያረጋግጡ

source: Check out 100+ new extensions that let you make Firefox your own.
am: Firefoxን የራስዎ ለማድረግ የሚያስችሉዎትን 100+ አዲስ ቅጥያዎችን ይመልከቱ።

source: Check review quality
am: የግምገማውን ጥራት ያረጋግጡ

source: Check that search string matches Example format
am: የፍለጋ ሕብረቁምፊ ና የምሳሌ ቅርጸት እንደ ሚመሳሰሉ ያረጋግጡ

source: Check your connection and try again.
am: ግንኙነትዎን ይፈትሹ እና እንደገና ይሞክሩ።

source: Check your network connection and then try reloading the page.
am: የአውታረ መረብ ግንኙነትዎን ያረጋግጡ እና ከዚያ ገጹን እንደገና ለመጫን ይሞክሩ።

source: Check your network connection or try reloading the page in a few moments.
am: የአውታረ መረብ ግንኙነትዎን ይፈትሹ ወይም ገጹን ከጥቂት ጊዜ በኋላ እንደገና ለመጫን ይሞክሩ።

source: Choose a color
am: ቀለም ይምረጡ

source: Choose a language
am: ቋንቋ ይምረጡ

source: Choose a login provider
am: መለያ አቅራቢ ይምረጡ

source: Choose an account
am: መለያ ይምረጡ

source: Choose a wallpaper that speaks to you.
am: እርስዎን የሚያናግር ልጣፍ ይምረጡ።

source: Choose provider
am: አቅራቢ ይምረጡ

source: Choose reason
am: ምክንያት ይምረጡ

source: Choose toolbar placement
am: የመሳሪያ አሞሌ አቀማመጥን ይምረጡ

source: Choose what to sync
am: ምን እንደሚመሳሰል ይምረጡ

source: Choose which trackers and scripts to block.
am: የትኞቹን መከታተያዎች እና ስክሪፕቶች እንደሚታገዱ ይምረጡ።

source: Choose your theme
am: ገጽታዎን ይምረጡ

source: City
am: ከተማ

source: Classic %s
am: ምርጥ %s

source: Clear
am: አጽዳ

source: Clear cookies and site data
am: ኩኪዎች እና የድረ-ገፅ ውሂብ ያጽዱ

source: Clear hostname
am: የአስተናጋጅ ስም ያጽዱ

source: Clear password
am: የይለፍ ቃል አጽዳ

source: Clear permission
am: ፍቃድ አጽዳ

source: Clear permissions
am: ፈቃዶችን ያጽዱ

source: Clear permissions on all sites
am: በሁሉም ድረ-ገፆች ላይ ፈቃዶችን ያጽዱ

source: Clear recent browsing history, cookies, and related data
am: የቅርብ ጊዜ የአሰሳ ታሪክን፣ ኩኪዎችን እና ተዛማጅ መረጃዎችን ያጽዱ

source: Clears cookies set by redirects to known tracking websites.
am: ወደታወቁ የመከታተያ ድረ-ገጾች በማዘዋወር የተዘጋጁ ኩኪዎችን ያጸዳል።

source: Clear text
am: ጽሑፍ አጽዳ

source: Clear username
am: የተጠቃሚ ስም አጽዳ

source: Click for more details
am: ለተጨማሪ ዝርዝሮች ጠቅ ያድርጉ

source: Close after one day
am: ከአንድ ቀን በኋላ ዝጋ

source: Close after one month
am: ከአንድ ወር በኋላ ዝጋ

source: Close after one week
am: ከአንድ ሳምንት በኋላ ዝጋ

source: Close all inactive tabs
am: ሁሉንም የቦዘኑ ትሮችን ዝጋ

source: Close all tabs
am: ሁሉንም ትሮች ዝጋ

source: Close bookmarks
am: ዕልባቶችን ዝጋ

source: Close custom tab menu sheet
am: ብጁ የትር ምናሌ ገፅን ዝጋ

source: Close extensions menu sheet
am: የቅጥያዎች ምናሌ ገፅን ዝጋ

source: Close main menu sheet
am: ዋናውን የምናሌ ገፅ ዝጋ

source: Close manually
am: በተግባር ዝጋ

source: Close private tabs
am: የግል ትሮችን ዝጋ

source: Close private tabs?
am: የግል ትሮች ይዘጉ?

source: Close reader view
am: የአንባቢ እይታን ዝጋ

source: Close review checker
am: የግምገማ አረጋጋጭን ዝጋ

source: Close save menu sheet
am: የማስቀመጥ ምናሌ ገፅን ዝጋ

source: Close survey
am: ዳሰሳ ጥናት ዝጋ

source: Close tab
am: ትርን ዝጋ

source: Close tabs
am: ትሮችን ዝጋ

source: Close tab %s
am: %s ትርን ዝጋ

source: Close tools menu sheet
am: የመሳሪያዎች ምናሌ ገፅን ዝጋ

source: Close Translations sheet
am: የትርጉም ገፅ ዝጋ

source: collapse
am: ሰብስብ

source: collapsed
am: ተሰብስቧል

source: Collapse group of synced tabs
am: የተመሳሰሉ የትሮች ቡድን ሰብስብ

source: Collapse inactive tabs
am: የቦዘኑ ትሮችን ሰብስብ

source: Collapse saved addresses
am: የተቀመጡ አድራሻዎችን ሰብስብ

source: Collapse saved cards
am: የተቀመጡ ካርዶችን ሰብስብ

source: Collapse saved passwords
am: የተቀመጡ የይለፍ ቃሎችን ሰብስብ

source: Collapse suggested addresses
am: የተጠቆሙ አድራሻዎችን ሰብስብ

source: Collapse suggested credit cards
am: የተጠቆሙ ክሬዲት ካርዶችን ሰብስብ

source: Collapse suggested logins
am: የተጠቆሙ መግቢያዎችን ሰብስብ

source: Collection %d
am: ስብስብ %d

source: Collection deleted
am: ስብስብ ተሰርዟል

source: Collection menu
am: የስብስብ ምናሌ

source: Collection name
am: የስብስብ ስም

source: Collection owner (User ID)
am: የስብስብ ባለቤት (የተጠቃሚ መታወቂያ)

source: Collection renamed
am: ስብስብ ተሰይሟል

source: Collections
am: ስብስቦች

source: Collection saved!
am: ስብስብ ተቀምጧል!

source: Collect the things that matter to you. Group together similar searches, sites, and tabs for quick access later.
am: ለእርስዎ አስፈላጊ የሆኑትን ነገሮች ይሰብስቡ። በኋላ ፈጣን መዳረሻ ለማግኘት ተመሳሳይ ፍለጋዎችን፣ ድረ-ገፆችን እና ትሮችን አንድ ላይ ያሰባስቡ።

source: Common myths about private browsing
am: ስለግል አሰሳ የተለመዱ አፈ ታሪኮች

source: Competitiveness
am: ተወዳዳሪነት

source: Complete action using
am: በመጠቀም አከናውን

source: Complete all 6 steps to set up %1$s for the best browsing experience.
am: ለምርጥ የአሰሳ ተሞክሮ %1$sን ለማዘጋጀት ሁሉንም 6 ደረጃዎች ያጠናቅቁ።

source: Completed task
am: የተጠናቀቀ ተግባር

source: Complete these 3 steps to set up %1$s for the best browsing experience.
am: %1$sን ለምርጥ የአሰሳ ተሞክሮ ለማዘጋጀት እነዚህን 3 ደረጃዎች ያጠናቅቁ።
